Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/uhphs.h
/* -------- UHPHS_FRINDEX : (UHPHS Offset: 0x1C) (R/W 32) UHPHS USB Frame Index Register -------- */
#define UHPHS_FRINDEX_FI_Pos                  _UINT32_(0)                                          /* (UHPHS_FRINDEX) Frame Index Position */
#define UHPHS_FRINDEX_FI_Msk                  (_UINT32_(0x3FFF) << UHPHS_FRINDEX_FI_Pos)           /* (UHPHS_FRINDEX) Frame Index Mask */
#define UHPHS_FRINDEX_FI(value)               (UHPHS_FRINDEX_FI_Msk & (_UINT32_(value) << UHPHS_FRINDEX_FI_Pos)) /* Assigment of value for FI in the UHPHS_FRINDEX register */
#define UHPHS_FRINDEX_Msk                     _UINT32_(0x00003FFF)                                 /* (UHPHS_FRINDEX) Register Mask  */


/* -------- UHPHS_CTRLDSSEGMENT : (UHPHS Offset: 0x20) (R/W 32) UHPHS Control Data Structure Segment Register -------- */
#define UHPHS_CTRLDSSEGMENT_Msk               _UINT32_(0x00000000)                                 /* (UHPHS_CTRLDSSEGMENT) Register Mask  */


/* -------- UHPHS_PERIODICLISTBASE : (UHPHS Offset: 0x24) (R/W 32) UHPHS Periodic Frame List Base Address Register -------- */
#define UHPHS_PERIODICLISTBASE_BA_Pos         _UINT32_(12)                                         /* (UHPHS_PERIODICLISTBASE) Base Address (Low) Position */
#define UHPHS_PERIODICLISTBASE_BA_Msk         (_UINT32_(0xFFFFF) << UHPHS_PERIODICLISTBASE_BA_Pos) /* (UHPHS_PERIODICLISTBASE) Base Address (Low) Mask */
#define UHPHS_PERIODICLISTBASE_BA(value)      (UHPHS_PERIODICLISTBASE_BA_Msk & (_UINT32_(value) << UHPHS_PERIODICLISTBASE_BA_Pos)) /* Assigment of value for BA in the UHPHS_PERIODICLISTBASE register */
#define UHPHS_PERIODICLISTBASE_Msk            _UINT32_(0xFFFFF000)                                 /* (UHPHS_PERIODICLISTBASE) Register Mask  */


/* -------- UHPHS_ASYNCLISTADDR : (UHPHS Offset: 0x28) (R/W 32) UHPHS Asynchronous List Address Register -------- */
#define UHPHS_ASYNCLISTADDR_LPL_Pos           _UINT32_(5)                                          /* (UHPHS_ASYNCLISTADDR) Link Pointer Low Position */
#define UHPHS_ASYNCLISTADDR_LPL_Msk           (_UINT32_(0x7FFFFFF) << UHPHS_ASYNCLISTADDR_LPL_Pos) /* (UHPHS_ASYNCLISTADDR) Link Pointer Low Mask */
#define UHPHS_ASYNCLISTADDR_LPL(value)        (UHPHS_ASYNCLISTADDR_LPL_Msk & (_UINT32_(value) << UHPHS_ASYNCLISTADDR_LPL_Pos)) /* Assigment of value for LPL in the UHPHS_ASYNCLISTADDR register */
#define UHPHS_ASYNCLISTADDR_Msk               _UINT32_(0xFFFFFFE0)                                 /* (UHPHS_ASYNCLISTADDR) Register Mask  */


/* -------- UHPHS_CONFIGFLAG : (UHPHS Offset: 0x50) (R/W 32) UHPHS Configured Flag Register -------- */
#define UHPHS_CONFIGFLAG_CF_Pos               _UINT32_(0)                                          /* (UHPHS_CONFIGFLAG) Configure Flag (read/write) Position */
#define UHPHS_CONFIGFLAG_CF_Msk               (_UINT32_(0x1) << UHPHS_CONFIGFLAG_CF_Pos)           /* (UHPHS_CONFIGFLAG) Configure Flag (read/write) Mask */
#define UHPHS_CONFIGFLAG_CF(value)            (UHPHS_CONFIGFLAG_CF_Msk & (_UINT32_(value) << UHPHS_CONFIGFLAG_CF_Pos)) /* Assigment of value for CF in the UHPHS_CONFIGFLAG register */
#define UHPHS_CONFIGFLAG_Msk                  _UINT32_(0x00000001)                                 /* (UHPHS_CONFIGFLAG) Register Mask  */


/* -------- UHPHS_PORTSC_0 : (UHPHS Offset: 0x54) (R/W 32) UHPHS Port Status and Control Register 0 -------- */
#define UHPHS_PORTSC_0_CCS_Pos                _UINT32_(0)                                          /* (UHPHS_PORTSC_0) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_0_CCS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_CCS_Pos)            /* (UHPHS_PORTSC_0) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_0_CCS(value)             (UHPHS_PORTSC_0_CCS_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_CCS_Pos)) /* Assigment of value for CCS in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_CSC_Pos                _UINT32_(1)                                          /* (UHPHS_PORTSC_0) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_0_CSC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_CSC_Pos)            /* (UHPHS_PORTSC_0) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_CSC(value)             (UHPHS_PORTSC_0_CSC_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_CSC_Pos)) /* Assigment of value for CSC in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PED_Pos                _UINT32_(2)                                          /* (UHPHS_PORTSC_0) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_0_PED_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_PED_Pos)            /* (UHPHS_PORTSC_0) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_0_PED(value)             (UHPHS_PORTSC_0_PED_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PED_Pos)) /* Assigment of value for PED in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PEDC_Pos               _UINT32_(3)                                          /* (UHPHS_PORTSC_0) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_0_PEDC_Msk               (_UINT32_(0x1) << UHPHS_PORTSC_0_PEDC_Pos)           /* (UHPHS_PORTSC_0) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_PEDC(value)            (UHPHS_PORTSC_0_PEDC_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PEDC_Pos)) /* Assigment of value for PEDC in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_OCA_Pos                _UINT32_(4)                                          /* (UHPHS_PORTSC_0) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_0_OCA_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_OCA_Pos)            /* (UHPHS_PORTSC_0) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_0_OCA(value)             (UHPHS_PORTSC_0_OCA_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_OCA_Pos)) /* Assigment of value for OCA in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_OCC_Pos                _UINT32_(5)                                          /* (UHPHS_PORTSC_0) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_0_OCC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_OCC_Pos)            /* (UHPHS_PORTSC_0) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_OCC(value)             (UHPHS_PORTSC_0_OCC_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_OCC_Pos)) /* Assigment of value for OCC in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_FPR_Pos                _UINT32_(6)                                          /* (UHPHS_PORTSC_0) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_0_FPR_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_FPR_Pos)            /* (UHPHS_PORTSC_0) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_0_FPR(value)             (UHPHS_PORTSC_0_FPR_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_FPR_Pos)) /* Assigment of value for FPR in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_SUS_Pos                _UINT32_(7)                                          /* (UHPHS_PORTSC_0) Suspend (read/write) Position */
#define UHPHS_PORTSC_0_SUS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_0_SUS_Pos)            /* (UHPHS_PORTSC_0) Suspend (read/write) Mask */
#define UHPHS_PORTSC_0_SUS(value)             (UHPHS_PORTSC_0_SUS_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_SUS_Pos)) /* Assigment of value for SUS in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PR_Pos                 _UINT32_(8)                                          /* (UHPHS_PORTSC_0) Port Reset (read/write) Position */
#define UHPHS_PORTSC_0_PR_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_0_PR_Pos)             /* (UHPHS_PORTSC_0) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_0_PR(value)              (UHPHS_PORTSC_0_PR_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PR_Pos)) /* Assigment of value for PR in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_LS_Pos                 _UINT32_(10)                                         /* (UHPHS_PORTSC_0) Line Status (read-only) Position */
#define UHPHS_PORTSC_0_LS_Msk                 (_UINT32_(0x3) << UHPHS_PORTSC_0_LS_Pos)             /* (UHPHS_PORTSC_0) Line Status (read-only) Mask */
#define UHPHS_PORTSC_0_LS(value)              (UHPHS_PORTSC_0_LS_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_LS_Pos)) /* Assigment of value for LS in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PP_Pos                 _UINT32_(12)                                         /* (UHPHS_PORTSC_0) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_0_PP_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_0_PP_Pos)             /* (UHPHS_PORTSC_0) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_0_PP(value)              (UHPHS_PORTSC_0_PP_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PP_Pos)) /* Assigment of value for PP in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PO_Pos                 _UINT32_(13)                                         /* (UHPHS_PORTSC_0) Port Owner (read/write) Position */
#define UHPHS_PORTSC_0_PO_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_0_PO_Pos)             /* (UHPHS_PORTSC_0) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_0_PO(value)              (UHPHS_PORTSC_0_PO_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PO_Pos)) /* Assigment of value for PO in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PIC_Pos                _UINT32_(14)                                         /* (UHPHS_PORTSC_0) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_0_PIC_Msk                (_UINT32_(0x3) << UHPHS_PORTSC_0_PIC_Pos)            /* (UHPHS_PORTSC_0) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_0_PIC(value)             (UHPHS_PORTSC_0_PIC_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PIC_Pos)) /* Assigment of value for PIC in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_PTC_Pos                _UINT32_(16)                                         /* (UHPHS_PORTSC_0) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_0_PTC_Msk                (_UINT32_(0xF) << UHPHS_PORTSC_0_PTC_Pos)            /* (UHPHS_PORTSC_0) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_0_PTC(value)             (UHPHS_PORTSC_0_PTC_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_PTC_Pos)) /* Assigment of value for PTC in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_WKCNNT_E_Pos           _UINT32_(20)                                         /* (UHPHS_PORTSC_0) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKCNNT_E_Msk           (_UINT32_(0x1) << UHPHS_PORTSC_0_WKCNNT_E_Pos)       /* (UHPHS_PORTSC_0) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKCNNT_E(value)        (UHPHS_PORTSC_0_WKCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_WKCNNT_E_Pos)) /* Assigment of value for WKCNNT_E in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_WKDSCNNT_E_Pos         _UINT32_(21)                                         /* (UHPHS_PORTSC_0) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKDSCNNT_E_Msk         (_UINT32_(0x1) << UHPHS_PORTSC_0_WKDSCNNT_E_Pos)     /* (UHPHS_PORTSC_0) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKDSCNNT_E(value)      (UHPHS_PORTSC_0_WKDSCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_WKDSCNNT_E_Pos)) /* Assigment of value for WKDSCNNT_E in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_WKOC_E_Pos             _UINT32_(22)                                         /* (UHPHS_PORTSC_0) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKOC_E_Msk             (_UINT32_(0x1) << UHPHS_PORTSC_0_WKOC_E_Pos)         /* (UHPHS_PORTSC_0) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKOC_E(value)          (UHPHS_PORTSC_0_WKOC_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_0_WKOC_E_Pos)) /* Assigment of value for WKOC_E in the UHPHS_PORTSC_0 register */
#define UHPHS_PORTSC_0_Msk                    _UINT32_(0x007FFDFF)                                 /* (UHPHS_PORTSC_0) Register Mask  */


/* -------- UHPHS_PORTSC_1 : (UHPHS Offset: 0x58) (R/W 32) UHPHS Port Status and Control Register 1 -------- */
#define UHPHS_PORTSC_1_CCS_Pos                _UINT32_(0)                                          /* (UHPHS_PORTSC_1) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_1_CCS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_CCS_Pos)            /* (UHPHS_PORTSC_1) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_1_CCS(value)             (UHPHS_PORTSC_1_CCS_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_CCS_Pos)) /* Assigment of value for CCS in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_CSC_Pos                _UINT32_(1)                                          /* (UHPHS_PORTSC_1) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_1_CSC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_CSC_Pos)            /* (UHPHS_PORTSC_1) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_CSC(value)             (UHPHS_PORTSC_1_CSC_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_CSC_Pos)) /* Assigment of value for CSC in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PED_Pos                _UINT32_(2)                                          /* (UHPHS_PORTSC_1) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_1_PED_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_PED_Pos)            /* (UHPHS_PORTSC_1) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_1_PED(value)             (UHPHS_PORTSC_1_PED_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PED_Pos)) /* Assigment of value for PED in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PEDC_Pos               _UINT32_(3)                                          /* (UHPHS_PORTSC_1) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_1_PEDC_Msk               (_UINT32_(0x1) << UHPHS_PORTSC_1_PEDC_Pos)           /* (UHPHS_PORTSC_1) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_PEDC(value)            (UHPHS_PORTSC_1_PEDC_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PEDC_Pos)) /* Assigment of value for PEDC in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_OCA_Pos                _UINT32_(4)                                          /* (UHPHS_PORTSC_1) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_1_OCA_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_OCA_Pos)            /* (UHPHS_PORTSC_1) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_1_OCA(value)             (UHPHS_PORTSC_1_OCA_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_OCA_Pos)) /* Assigment of value for OCA in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_OCC_Pos                _UINT32_(5)                                          /* (UHPHS_PORTSC_1) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_1_OCC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_OCC_Pos)            /* (UHPHS_PORTSC_1) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_OCC(value)             (UHPHS_PORTSC_1_OCC_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_OCC_Pos)) /* Assigment of value for OCC in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_FPR_Pos                _UINT32_(6)                                          /* (UHPHS_PORTSC_1) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_1_FPR_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_FPR_Pos)            /* (UHPHS_PORTSC_1) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_1_FPR(value)             (UHPHS_PORTSC_1_FPR_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_FPR_Pos)) /* Assigment of value for FPR in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_SUS_Pos                _UINT32_(7)                                          /* (UHPHS_PORTSC_1) Suspend (read/write) Position */
#define UHPHS_PORTSC_1_SUS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_1_SUS_Pos)            /* (UHPHS_PORTSC_1) Suspend (read/write) Mask */
#define UHPHS_PORTSC_1_SUS(value)             (UHPHS_PORTSC_1_SUS_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_SUS_Pos)) /* Assigment of value for SUS in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PR_Pos                 _UINT32_(8)                                          /* (UHPHS_PORTSC_1) Port Reset (read/write) Position */
#define UHPHS_PORTSC_1_PR_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_1_PR_Pos)             /* (UHPHS_PORTSC_1) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_1_PR(value)              (UHPHS_PORTSC_1_PR_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PR_Pos)) /* Assigment of value for PR in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_LS_Pos                 _UINT32_(10)                                         /* (UHPHS_PORTSC_1) Line Status (read-only) Position */
#define UHPHS_PORTSC_1_LS_Msk                 (_UINT32_(0x3) << UHPHS_PORTSC_1_LS_Pos)             /* (UHPHS_PORTSC_1) Line Status (read-only) Mask */
#define UHPHS_PORTSC_1_LS(value)              (UHPHS_PORTSC_1_LS_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_LS_Pos)) /* Assigment of value for LS in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PP_Pos                 _UINT32_(12)                                         /* (UHPHS_PORTSC_1) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_1_PP_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_1_PP_Pos)             /* (UHPHS_PORTSC_1) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_1_PP(value)              (UHPHS_PORTSC_1_PP_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PP_Pos)) /* Assigment of value for PP in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PO_Pos                 _UINT32_(13)                                         /* (UHPHS_PORTSC_1) Port Owner (read/write) Position */
#define UHPHS_PORTSC_1_PO_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_1_PO_Pos)             /* (UHPHS_PORTSC_1) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_1_PO(value)              (UHPHS_PORTSC_1_PO_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PO_Pos)) /* Assigment of value for PO in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PIC_Pos                _UINT32_(14)                                         /* (UHPHS_PORTSC_1) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_1_PIC_Msk                (_UINT32_(0x3) << UHPHS_PORTSC_1_PIC_Pos)            /* (UHPHS_PORTSC_1) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_1_PIC(value)             (UHPHS_PORTSC_1_PIC_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PIC_Pos)) /* Assigment of value for PIC in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_PTC_Pos                _UINT32_(16)                                         /* (UHPHS_PORTSC_1) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_1_PTC_Msk                (_UINT32_(0xF) << UHPHS_PORTSC_1_PTC_Pos)            /* (UHPHS_PORTSC_1) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_1_PTC(value)             (UHPHS_PORTSC_1_PTC_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_PTC_Pos)) /* Assigment of value for PTC in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_WKCNNT_E_Pos           _UINT32_(20)                                         /* (UHPHS_PORTSC_1) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKCNNT_E_Msk           (_UINT32_(0x1) << UHPHS_PORTSC_1_WKCNNT_E_Pos)       /* (UHPHS_PORTSC_1) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKCNNT_E(value)        (UHPHS_PORTSC_1_WKCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_WKCNNT_E_Pos)) /* Assigment of value for WKCNNT_E in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_WKDSCNNT_E_Pos         _UINT32_(21)                                         /* (UHPHS_PORTSC_1) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKDSCNNT_E_Msk         (_UINT32_(0x1) << UHPHS_PORTSC_1_WKDSCNNT_E_Pos)     /* (UHPHS_PORTSC_1) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKDSCNNT_E(value)      (UHPHS_PORTSC_1_WKDSCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_WKDSCNNT_E_Pos)) /* Assigment of value for WKDSCNNT_E in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_WKOC_E_Pos             _UINT32_(22)                                         /* (UHPHS_PORTSC_1) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKOC_E_Msk             (_UINT32_(0x1) << UHPHS_PORTSC_1_WKOC_E_Pos)         /* (UHPHS_PORTSC_1) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKOC_E(value)          (UHPHS_PORTSC_1_WKOC_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_1_WKOC_E_Pos)) /* Assigment of value for WKOC_E in the UHPHS_PORTSC_1 register */
#define UHPHS_PORTSC_1_Msk                    _UINT32_(0x007FFDFF)                                 /* (UHPHS_PORTSC_1) Register Mask  */


