Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/uhphs.h
/* -------- UHPHS_PORTSC_2 : (UHPHS Offset: 0x5C) (R/W 32) UHPHS Port Status and Control Register 2 -------- */
#define UHPHS_PORTSC_2_CCS_Pos                _UINT32_(0)                                          /* (UHPHS_PORTSC_2) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_2_CCS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_CCS_Pos)            /* (UHPHS_PORTSC_2) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_2_CCS(value)             (UHPHS_PORTSC_2_CCS_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_CCS_Pos)) /* Assigment of value for CCS in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_CSC_Pos                _UINT32_(1)                                          /* (UHPHS_PORTSC_2) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_2_CSC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_CSC_Pos)            /* (UHPHS_PORTSC_2) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_CSC(value)             (UHPHS_PORTSC_2_CSC_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_CSC_Pos)) /* Assigment of value for CSC in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PED_Pos                _UINT32_(2)                                          /* (UHPHS_PORTSC_2) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_2_PED_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_PED_Pos)            /* (UHPHS_PORTSC_2) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_2_PED(value)             (UHPHS_PORTSC_2_PED_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PED_Pos)) /* Assigment of value for PED in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PEDC_Pos               _UINT32_(3)                                          /* (UHPHS_PORTSC_2) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_2_PEDC_Msk               (_UINT32_(0x1) << UHPHS_PORTSC_2_PEDC_Pos)           /* (UHPHS_PORTSC_2) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_PEDC(value)            (UHPHS_PORTSC_2_PEDC_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PEDC_Pos)) /* Assigment of value for PEDC in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_OCA_Pos                _UINT32_(4)                                          /* (UHPHS_PORTSC_2) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_2_OCA_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_OCA_Pos)            /* (UHPHS_PORTSC_2) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_2_OCA(value)             (UHPHS_PORTSC_2_OCA_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_OCA_Pos)) /* Assigment of value for OCA in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_OCC_Pos                _UINT32_(5)                                          /* (UHPHS_PORTSC_2) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_2_OCC_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_OCC_Pos)            /* (UHPHS_PORTSC_2) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_OCC(value)             (UHPHS_PORTSC_2_OCC_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_OCC_Pos)) /* Assigment of value for OCC in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_FPR_Pos                _UINT32_(6)                                          /* (UHPHS_PORTSC_2) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_2_FPR_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_FPR_Pos)            /* (UHPHS_PORTSC_2) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_2_FPR(value)             (UHPHS_PORTSC_2_FPR_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_FPR_Pos)) /* Assigment of value for FPR in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_SUS_Pos                _UINT32_(7)                                          /* (UHPHS_PORTSC_2) Suspend (read/write) Position */
#define UHPHS_PORTSC_2_SUS_Msk                (_UINT32_(0x1) << UHPHS_PORTSC_2_SUS_Pos)            /* (UHPHS_PORTSC_2) Suspend (read/write) Mask */
#define UHPHS_PORTSC_2_SUS(value)             (UHPHS_PORTSC_2_SUS_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_SUS_Pos)) /* Assigment of value for SUS in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PR_Pos                 _UINT32_(8)                                          /* (UHPHS_PORTSC_2) Port Reset (read/write) Position */
#define UHPHS_PORTSC_2_PR_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_2_PR_Pos)             /* (UHPHS_PORTSC_2) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_2_PR(value)              (UHPHS_PORTSC_2_PR_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PR_Pos)) /* Assigment of value for PR in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_LS_Pos                 _UINT32_(10)                                         /* (UHPHS_PORTSC_2) Line Status (read-only) Position */
#define UHPHS_PORTSC_2_LS_Msk                 (_UINT32_(0x3) << UHPHS_PORTSC_2_LS_Pos)             /* (UHPHS_PORTSC_2) Line Status (read-only) Mask */
#define UHPHS_PORTSC_2_LS(value)              (UHPHS_PORTSC_2_LS_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_LS_Pos)) /* Assigment of value for LS in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PP_Pos                 _UINT32_(12)                                         /* (UHPHS_PORTSC_2) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_2_PP_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_2_PP_Pos)             /* (UHPHS_PORTSC_2) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_2_PP(value)              (UHPHS_PORTSC_2_PP_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PP_Pos)) /* Assigment of value for PP in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PO_Pos                 _UINT32_(13)                                         /* (UHPHS_PORTSC_2) Port Owner (read/write) Position */
#define UHPHS_PORTSC_2_PO_Msk                 (_UINT32_(0x1) << UHPHS_PORTSC_2_PO_Pos)             /* (UHPHS_PORTSC_2) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_2_PO(value)              (UHPHS_PORTSC_2_PO_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PO_Pos)) /* Assigment of value for PO in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PIC_Pos                _UINT32_(14)                                         /* (UHPHS_PORTSC_2) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_2_PIC_Msk                (_UINT32_(0x3) << UHPHS_PORTSC_2_PIC_Pos)            /* (UHPHS_PORTSC_2) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_2_PIC(value)             (UHPHS_PORTSC_2_PIC_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PIC_Pos)) /* Assigment of value for PIC in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_PTC_Pos                _UINT32_(16)                                         /* (UHPHS_PORTSC_2) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_2_PTC_Msk                (_UINT32_(0xF) << UHPHS_PORTSC_2_PTC_Pos)            /* (UHPHS_PORTSC_2) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_2_PTC(value)             (UHPHS_PORTSC_2_PTC_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_PTC_Pos)) /* Assigment of value for PTC in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_WKCNNT_E_Pos           _UINT32_(20)                                         /* (UHPHS_PORTSC_2) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKCNNT_E_Msk           (_UINT32_(0x1) << UHPHS_PORTSC_2_WKCNNT_E_Pos)       /* (UHPHS_PORTSC_2) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKCNNT_E(value)        (UHPHS_PORTSC_2_WKCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_WKCNNT_E_Pos)) /* Assigment of value for WKCNNT_E in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_WKDSCNNT_E_Pos         _UINT32_(21)                                         /* (UHPHS_PORTSC_2) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKDSCNNT_E_Msk         (_UINT32_(0x1) << UHPHS_PORTSC_2_WKDSCNNT_E_Pos)     /* (UHPHS_PORTSC_2) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKDSCNNT_E(value)      (UHPHS_PORTSC_2_WKDSCNNT_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_WKDSCNNT_E_Pos)) /* Assigment of value for WKDSCNNT_E in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_WKOC_E_Pos             _UINT32_(22)                                         /* (UHPHS_PORTSC_2) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKOC_E_Msk             (_UINT32_(0x1) << UHPHS_PORTSC_2_WKOC_E_Pos)         /* (UHPHS_PORTSC_2) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKOC_E(value)          (UHPHS_PORTSC_2_WKOC_E_Msk & (_UINT32_(value) << UHPHS_PORTSC_2_WKOC_E_Pos)) /* Assigment of value for WKOC_E in the UHPHS_PORTSC_2 register */
#define UHPHS_PORTSC_2_Msk                    _UINT32_(0x007FFDFF)                                 /* (UHPHS_PORTSC_2) Register Mask  */


/* -------- UHPHS_INSNREG00 : (UHPHS Offset: 0x90) (R/W 32) EHCI Synopsys-Specific Registers 00 -------- */
#define UHPHS_INSNREG00_En_Pos                _UINT32_(0)                                          /* (UHPHS_INSNREG00) Enable this Register Position */
#define UHPHS_INSNREG00_En_Msk                (_UINT32_(0x1) << UHPHS_INSNREG00_En_Pos)            /* (UHPHS_INSNREG00) Enable this Register Mask */
#define UHPHS_INSNREG00_En(value)             (UHPHS_INSNREG00_En_Msk & (_UINT32_(value) << UHPHS_INSNREG00_En_Pos)) /* Assigment of value for En in the UHPHS_INSNREG00 register */
#define UHPHS_INSNREG00_MFC_16_Pos            _UINT32_(1)                                          /* (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Position */
#define UHPHS_INSNREG00_MFC_16_Msk            (_UINT32_(0x7FF) << UHPHS_INSNREG00_MFC_16_Pos)      /* (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_16(value)         (UHPHS_INSNREG00_MFC_16_Msk & (_UINT32_(value) << UHPHS_INSNREG00_MFC_16_Pos)) /* Assigment of value for MFC_16 in the UHPHS_INSNREG00 register */
#define UHPHS_INSNREG00_MFC_8_Pos             _UINT32_(12)                                         /* (UHPHS_INSNREG00) Microframe Counter with Byte Interface Position */
#define UHPHS_INSNREG00_MFC_8_Msk             (_UINT32_(0x3) << UHPHS_INSNREG00_MFC_8_Pos)         /* (UHPHS_INSNREG00) Microframe Counter with Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_8(value)          (UHPHS_INSNREG00_MFC_8_Msk & (_UINT32_(value) << UHPHS_INSNREG00_MFC_8_Pos)) /* Assigment of value for MFC_8 in the UHPHS_INSNREG00 register */
#define UHPHS_INSNREG00_Debug_Pos             _UINT32_(14)                                         /* (UHPHS_INSNREG00) Debug Purposes Position */
#define UHPHS_INSNREG00_Debug_Msk             (_UINT32_(0x3F) << UHPHS_INSNREG00_Debug_Pos)        /* (UHPHS_INSNREG00) Debug Purposes Mask */
#define UHPHS_INSNREG00_Debug(value)          (UHPHS_INSNREG00_Debug_Msk & (_UINT32_(value) << UHPHS_INSNREG00_Debug_Pos)) /* Assigment of value for Debug in the UHPHS_INSNREG00 register */
#define UHPHS_INSNREG00_Msk                   _UINT32_(0x000FFFFF)                                 /* (UHPHS_INSNREG00) Register Mask  */


